Autodesk.Revit.DB.FabricationService.GetButton(System.Int32,System.Int32)
Gets the service button for a given palette index and button index from the service.
paletteIndex:
The palette index.
buttonIndex:
The button index.
Returns:
The service button
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index paletteIndex is not larger or equal to 0 and less than PaletteCount
Since:
2016

Autodesk.Revit.DB.FabricationService.GetButtonCount(System.Int32)
Gets the number of buttons for a given palette in the service.
palette:
The index of the palette
Returns:
The number of buttons.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index palette is not larger or equal to 0 and less than PaletteCount
Since:
2016

Autodesk.Revit.DB.FabricationService.OverrideServiceButtonExclusion(System.Int32,System.Int32,System.Boolean)
Overrides the default service button exclusions, used by Route and Fill, Design to Fabrication, or Multi Point Routing for the current user and session only.
paletteIndex:
The index of the service palette to exclude the service button from.
buttonIndex:
The index of the service button to exclude.
exclude:
Pass true to exclude from being used by Route and Fill or Design to Fabrication.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index paletteIndex is not larger or equal to 0 and less than PaletteCount
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationService.SetServicePaletteExclusions(System.Collections.Generic.IList{System.Int32})
Sets the service palette exclusions, used by Route and Fill or Design to Fabrication commands, for the current user and session only. This will alter them from the default configuration exclusions to only exclude those palettes passed.
excludedPalettes:
A list of service palette indexes to be excluded.
Returns:
Returns true if succeeded to set the exclusions to the specified palette(s).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
paletteIndices contains an index that is not larger or equal to 0 and less than PaletteCount
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2022

Autodesk.Revit.DB.FabricationService.IsPaletteExcluded(System.Int32)
Get whether a service palette is excluded from being used by the Route and Fill, Design to Fabrication, or Multi Point Routing commands. The default configuration values may be overridden by SetServicePaletteExclusions.
paletteIndex:
The index of the palete.
Returns:
Returns true if the palette indexed by paletteIndex is currently to be excluded.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index paletteIndex is not larger or equal to 0 and less than PaletteCount
Since:
2022

Autodesk.Revit.DB.FabricationService.GetPaletteName(System.Int32)
Gets the name of a palette based on palette index.
palette:
The index of the palette.
Returns:
The name of the palette.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index palette is not larger or equal to 0 and less than PaletteCount
Since:
2022